In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [6]:
A = [30,10,2,5,6,81]
B = [1,9,6,6,94,48]
C = np.array(A+B).reshape(2,6)

In [7]:
C

array([[30, 10,  2,  5,  6, 81],
       [ 1,  9,  6,  6, 94, 48]])

In [8]:
df = pd.DataFrame(C)

In [9]:
df

    0   1  2  3   4   5
0  30  10  2  5   6  81
1   1   9  6  6  94  48

In [12]:
df.columns = ["第一場","第二場","第三場","第四場","第五場","第六場"]

In [13]:
df

   第一場  第二場  第三場  第四場  第五場  第六場
0   30   10    2    5    6   81
1    1    9    6    6   94   48

In [16]:
df.index = range(1,3)

In [17]:
df

   第一場  第二場  第三場  第四場  第五場  第六場
1   30   10    2    5    6   81
2    1    9    6    6   94   48